uploaded_forms/AFQPN5363M/2015-16/VIJAY_NALAWADE_fourth_a.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://avatax.avalara.com/services"><SOAP-ENV:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><wsse:UsernameToken><wsse:Username>1100119845</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">55EE9FF205D8224A</wsse:Password></wsse:UsernameToken></wsse:Security><Profile xmlns="http://avatax.avalara.com/services" SOAP-ENV:actor="http://schemas.xmlsoap.org/soap/actor/next" SOAP-ENV:mustUnderstand="0"><Name>13.7.0.0</Name><Client>OpenCart||2.0.2.0||02.00.02.00</Client><Adapter>avatax4php,14.2.0.0</Adapter></Profile></SOAP-ENV:Header><SOAP-ENV:Body><ns1:GetTax><ns1:GetTaxRequest><ns1:CompanyCode>oc2020</ns1:CompanyCode><ns1:DocType>SalesOrder</ns1:DocType><ns1:DocCode>taxphp</ns1:DocCode><ns1:DocDate>2015-10-06</ns1:DocDate><ns1:SalespersonCode></ns1:SalespersonCode><ns1:CustomerCode>3</ns1:CustomerCode><ns1:CustomerUsageType></ns1:CustomerUsageType><ns1:Discount>0</ns1:Discount><ns1:PurchaseOrderNo></ns1:PurchaseOrderNo><ns1:ExemptionNo></ns1:ExemptionNo><ns1:OriginCode>0</ns1:OriginCode><ns1:DestinationCode>1</ns1:DestinationCode><ns1:Addresses><ns1:BaseAddress><ns1:AddressCode>0</ns1:AddressCode><ns1:Line1>#3100</ns1:Line1><ns1:Line2></ns1:Line2><ns1:City>SEATTLE</ns1:City><ns1:Region>WA</ns1:Region><ns1:PostalCode>98104-1094</ns1:PostalCode><ns1:Country>US</ns1:Country><ns1:TaxRegionId>0</ns1:TaxRegionId></ns1:BaseAddress><ns1:BaseAddress><ns1:AddressCode>1</ns1:AddressCode><ns1:Line1>100 Ravine Lane NE</ns1:Line1><ns1:Line2></ns1:Line2><ns1:City>Bainbridge Island</ns1:City><ns1:Region>WA</ns1:Region><ns1:PostalCode>98110-2687</ns1:PostalCode><ns1:Country>US</ns1:Country><ns1:TaxRegionId>0</ns1:TaxRegionId></ns1:BaseAddress></ns1:Addresses><ns1:Lines><ns1:Line><ns1:No>40</ns1:No><ns1:OriginCode>0</ns1:OriginCode><ns1:DestinationCode>1</ns1:DestinationCode><ns1:ItemCode>product 11</ns1:ItemCode><ns1:TaxCode>Taxable Goods</ns1:TaxCode><ns1:Qty>1</ns1:Qty><ns1:Amount>101</ns1:Amount><ns1:Discounted>false</ns1:Discounted><ns1:RevAcct></ns1:RevAcct><ns1:Ref1></ns1:Ref1><ns1:Ref2></ns1:Ref2><ns1:ExemptionNo></ns1:ExemptionNo><ns1:CustomerUsageType></ns1:CustomerUsageType><ns1:Description>Desktops, Phones &amp;amp; PDAs, </ns1:Description></ns1:Line><ns1:Line><ns1:No>2</ns1:No><ns1:OriginCode>0</ns1:OriginCode><ns1:DestinationCode>1</ns1:DestinationCode><ns1:ItemCode>flat.flat</ns1:ItemCode><ns1:TaxCode>Taxable Goods</ns1:TaxCode><ns1:Qty>1</ns1:Qty><ns1:Amount>5.00</ns1:Amount><ns1:Discounted>false</ns1:Discounted><ns1:RevAcct></ns1:RevAcct><ns1:Ref1></ns1:Ref1><ns1:Ref2></ns1:Ref2><ns1:ExemptionNo></ns1:ExemptionNo><ns1:CustomerUsageType></ns1:CustomerUsageType><ns1:Description>Flat Shipping Rate</ns1:Description></ns1:Line><ns1:Line><ns1:No>3</ns1:No><ns1:OriginCode>0</ns1:OriginCode><ns1:DestinationCode>1</ns1:DestinationCode><ns1:ItemCode>handling</ns1:ItemCode><ns1:Qty>1</ns1:Qty><ns1:Amount>10</ns1:Amount><ns1:Discounted>false</ns1:Discounted><ns1:RevAcct></ns1:RevAcct><ns1:Ref1></ns1:Ref1><ns1:Ref2></ns1:Ref2><ns1:ExemptionNo></ns1:ExemptionNo><ns1:CustomerUsageType></ns1:CustomerUsageType><ns1:Description>Handling Fee</ns1:Description></ns1:Line></ns1:Lines><ns1:DetailLevel>Tax</ns1:DetailLevel><ns1:HashCode>0</ns1:HashCode><ns1:LocationCode></ns1:LocationCode><ns1:Commit>false</ns1:Commit><ns1:ServiceMode>Automatic</ns1:ServiceMode><ns1:PaymentDate>1900-01-01</ns1:PaymentDate><ns1:ExchangeRate>1</ns1:ExchangeRate><ns1:ExchangeRateEffDate>1900-01-01</ns1:ExchangeRateEffDate></ns1:GetTaxRequest></ns1:GetTax></SOAP-ENV:Body></SOAP-ENV:Envelope>